Repository: imcat-owo/dudu-native
Catalog: Dudu/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# initiative.form.titlePh
source: Title, e.g. Good morning
zh_hans: 标题，比如：早安
zh_hant: 標題，比如：早安

# initiative.form.topicPh
source: What to say, e.g. remind her to drink water, ask how she slept
zh_hans: 说什么，比如：提醒她喝水，问问她昨晚睡得好不好
zh_hant: 說什麼，比如：提醒她喝水，問問她昨晚睡得好不好

# initiative.list.empty
source: No promises yet. Tell him, e.g. "say good morning to me at 8 every day".
zh_hans: 还没有约定。跟他说一声，比如「每天早上八点跟我说早安」。
zh_hant: 還沒有約定。跟他說一聲，比如「每天早上八點跟我說早安」。

# initiative.nextFire
source: Next %1$@
zh_hans: 下次 %1$@
zh_hant: 下次 %1$@

# initiative.notif.body
source: Open the chat — he has something to tell you
zh_hans: 点开看看，他有话想跟你说
zh_hant: 點開看看，他有話想跟你說

# initiative.runNow.failed
source: Couldn't send it
zh_hans: 没能发出去
zh_hant: 沒能發出去

# initiative.runNow.reason
source: Reason:
zh_hans: 原因：
zh_hant: 原因：

# initiative.runNow.sent
source: Sent
zh_hans: 已发送
zh_hant: 已發送

# initiative.section.desc
source: At the times you set, he will come talk to you first.
zh_hans: 约好时间，他会主动来找你说话。
zh_hant: 約好時間，他會主動來找你說話。

# initiative.section.title
source: Proactive promises
zh_hans: 主动约定
zh_hant: 主動約定

# jev.choiceUnavailable
source: Choice unavailable
zh_hans: 选项不可用
zh_hant: 選項不可用

# jev.chooseA11y
source: %1$@: %2$@ (option %3$@)
zh_hans: %1$@：%2$@（第 %3$@ 个选项）
zh_hant: %1$@：%2$@（第 %3$@ 個選項）

# jev.chooseExhibit
source: Choose this exhibit
zh_hans: 选这个展品
zh_hant: 選這個展品

# jev.chooseOption
source: Choose this option
zh_hans: 选这个选项
zh_hant: 選這個選項

# jev.couldntDisplay
source: The choices could not be displayed. Please retry.
zh_hans: 选项显示不了，请重试。
zh_hant: 選項顯示不了，請重試。

# jev.liveDecision
source: Live Jev · model decision
zh_hans: 实时 Jev·模型决策
zh_hant: 實時 Jev·模型決策

# jev.openConversation
source: Open an active conversation to choose an option.
zh_hans: 打开一个进行中的对话来选择。
zh_hant: 打開一個進行中的對話來選擇。

# jev.openConversationRetry
source: Open an active conversation to retry a choice.
zh_hans: 打开一个进行中的对话来重试选择。
zh_hant: 打開一個進行中的對話來重試選擇。

# jev.preferredOption
source: Previous preference: %1$@
zh_hans: 上次的选择：%1$@
zh_hant: 上次的選擇：%1$@

# jev.preparing
source: Preparing choices…
zh_hans: 准备选项中…
zh_hant: 準備選項中…

# jev.sampleDecision
source: Sample · preset decision
zh_hans: 示例·预设决策
zh_hant: 示例·預設決策

# jev.selected
source: Selected: %1$@
zh_hans: 已选：%1$@
zh_hant: 已選：%1$@

# jev.source
source: Source: %1$@
zh_hans: 来源：%1$@
zh_hant: 來源：%1$@

# jev.staleChoice
source: Previous choice
zh_hans: 之前的选择
zh_hant: 之前的選擇

# jev.submitted
source: Choice submitted
zh_hans: 选择已提交
zh_hant: 選擇已提交

# jev.unknownChoice
source: Unknown choice
zh_hans: 未知选项
zh_hant: 未知選項

# kb.deleteConfirm
source: Delete "%1$@"? Its chunks will go too.
zh_hans: 确定删掉「%1$@」？里面的段落也会一起删掉。
zh_hant: 確定刪掉「%1$@」？裏面的段落也會一起刪掉。

# kb.deleteTitle
source: Delete this document?
zh_hans: 删掉这篇文档？
zh_hant: 刪掉這篇文檔？

# kb.empty
source: Knowledge base is empty
zh_hans: 知识库空空的
zh_hant: 知識庫空空的

# kb.emptyDetail
source: Upload a txt or md document. I'll read it and remember, so you can ask me about it later.
zh_hans: 传个 txt 或 md 文档进来，我读完记下来，你问我就翻。
zh_hant: 傳個 txt 或 md 文檔進來，我讀完記下來，你問我就翻。

# kb.emptyDocument
source: This document is empty — nothing to remember.
zh_hans: 这个文档是空的，没什么可记的。
zh_hant: 這個文檔是空的，沒什麼可記的。

# kb.formatsNote
source: Supports txt / md / pdf. Word support is coming.
zh_hans: 支持 txt / md / pdf。Word 后面会支持。
zh_hant: 支持 txt / md / pdf。Word 後面會支持。

# kb.indexFailed
source: Got stuck reading the document: %1$@
zh_hans: 读文档的时候卡住了：%1$@
zh_hant: 讀文檔的時候卡住了：%1$@

# kb.indexingDone
source: All read and memorized
zh_hans: 读完了，都记下了
zh_hant: 讀完了，都記下了

# kb.indexingStage
source: Memorizing… %1$@/%2$@
zh_hans: 正在记住… %1$@/%2$@
zh_hant: 正在記住… %1$@/%2$@

# kb.indexingTask
source: Indexing knowledge base
zh_hans: 知识库索引
zh_hant: 知識庫索引

# kb.noApiGroup
source: No API group configured yet — I need one to read documents. Set one up first.
zh_hans: 还没配 API 分组，我得靠它来读文档，先去配一个吧。
zh_hant: 還沒配 API 分組，我得靠它來讀文檔，先去配一個吧。

# kb.pdfExtractFailed
source: PDF text extraction failed: %1$@
zh_hans: PDF 文字提取失败了：%1$@
zh_hant: PDF 文字提取失敗了：%1$@

# kb.pdfExtractTimeout
source: Extraction timed out — the PDF might be too large or stuck. Try a smaller one.
zh_hans: 提取超时了，PDF 可能太大或卡住了，换个小点的试试
zh_hant: 提取超時了，PDF 可能太大或卡住了，換個小點的試試

# kb.pdfJsLoadTimeout
source: Couldn't load the PDF parser — check your connection and try again.
zh_hans: PDF 解析库没加载出来，检查下网络再试一次
zh_hant: PDF 解析庫沒加載出來，檢查下網絡再試一次

# kb.progress.chunking
source: Splitting…
zh_hans: 正在切分…
zh_hant: 正在切分…

# kb.progress.embedding
source: Memorizing… %1$@/%2$@
zh_hans: 正在记住… %1$@/%2$@
zh_hant: 正在記住… %1$@/%2$@

# kb.reindex
source: Re-index
zh_hans: 重新索引
zh_hant: 重新索引

# kb.status.failed
source: Couldn't read it — try deleting and re-uploading
zh_hans: 没读进去，删掉重传试试
zh_hant: 沒讀進去，刪掉重傳試試

# kb.status.indexing
source: Reading…
zh_hans: 正在读…
zh_hant: 正在讀…

# kb.status.ready
source: %1$@ chunks · ready
zh_hans: %1$@ 段 · 就绪
zh_hant: %1$@ 段 · 就緒

# kb.subtitle
source: Upload documents for me — later, I can look things up and answer.
zh_hans: 传些文档给我，以后问起来，我能翻出来答你。
zh_hant: 傳些文檔給我，以後問起來，我能翻出來答你。

# kb.title
source: Knowledge Base
zh_hans: 知识库
zh_hant: 知識庫

# kb.unsupportedSoon
source: Word isn't readable yet — upload txt, md or pdf for now.
zh_hans: Word 暂时还读不了，先传 txt、md 或 pdf 吧。
zh_hant: Word 暫時還讀不了，先傳 txt、md 或 pdf 吧。

# kb.unsupportedType
source: I don't recognize this format yet — txt, md and pdf only.
zh_hans: 这个格式我还不认，只吃 txt、md 和 pdf。
zh_hant: 這個格式我還不認，只喫 txt、md 和 pdf。

# kb.upload
source: Upload document
zh_hans: 上传文档
zh_hant: 上傳文檔

# mail.allMessages
source: All messages
zh_hans: 全部
zh_hant: 全部

# mail.attachmentCount
source: %1$@ attachment(s)
zh_hans: %1$@ 个附件
zh_hant: %1$@ 個附件

# mail.attachments
source: Attachments
zh_hans: 附件
zh_hant: 附件

# mail.bcc
source: Bcc
zh_hans: 密送
zh_hant: 密送

# mail.bodyPlaceholder
source: Start your message…
zh_hans: 写吧…
zh_hant: 寫吧…

# mail.cc
source: Cc
zh_hans: 抄送
zh_hant: 抄送

# mail.compose
source: Compose
zh_hans: 写邮件
zh_hant: 寫郵件

# mail.connectGoogle
source: Connect Google in Connections to read your mail here.
zh_hans: 去「连接」里连上 Google，就能在这里读邮件。
zh_hant: 去「連接」裏連上 Google，就能在這裏讀郵件。

# mail.draftDetail
source: To: %1$@ · saved %2$@
zh_hans: 收件人：%1$@ · %2$@ 保存
zh_hant: 收件人：%1$@ · %2$@ 保存

# mail.draftSaved
source: Draft saved in Dudu.
zh_hans: 草稿已保存在嘟嘟。
zh_hant: 草稿已保存在嘟嘟。

# mail.draftsEmpty
source: Messages you save as drafts will be here when you're ready.
zh_hans: 草稿会在这儿等你。
zh_hant: 草稿會在這兒等你。

# mail.draftsTab
source: Drafts · %1$@
zh_hans: 草稿 · %1$@
zh_hant: 草稿 · %1$@

# mail.editorSubtitle
source: From %1$@ · saved privately in Dudu
zh_hans: 发件人 %1$@ · 仅保存在嘟嘟
zh_hant: 發件人 %1$@ · 僅保存在嘟嘟

# mail.emptyInbox
source: Nothing in your inbox
zh_hans: 收件箱空空的
zh_hant: 收件箱空空的

# mail.freshPage
source: A fresh page
zh_hans: 新的一页
zh_hant: 新的一頁

# mail.message
source: Message
zh_hans: 正文
zh_hant: 正文

# mail.newTitle
source: New message
zh_hans: 写新邮件
zh_hant: 寫新郵件

# mail.noMatch
source: No matching messages
zh_hans: 没有匹配的邮件
zh_hant: 沒有匹配的郵件

# mail.openAttachment
source: Open attachment
zh_hans: 打开附件
zh_hant: 打開附件

# mail.optional
source: Optional
zh_hans: 可选
zh_hant: 可選

# mail.pdfAttachment
source: %1$@ pages · PDF attachment
zh_hans: %1$@ 页 · PDF 附件
zh_hant: %1$@ 頁 · PDF 附件

# mail.reloadConversation
source: Reload conversation
zh_hans: 重新加载对话
zh_hant: 重新加載對話

# mail.replySaved
source: Reply saved in your local Sent mail.
zh_hans: 回复已存进本地已发送。
zh_hant: 回覆已存進本地已發送。

# mail.replyTitle
source: Write a reply
zh_hans: 写回复
zh_hant: 寫回復

# mail.reviewEmail
source: Review email
zh_hans: 检查邮件
zh_hant: 檢查郵件

# mail.reviewNote
source: You'll review the recipients, message and attachments before anything is sent.
zh_hans: 发送前你会核对收件人、消息和附件。
zh_hant: 發送前你會覈對收件人、消息和附件。

# mail.saveDraft
source: Save draft
zh_hans: 存草稿
zh_hant: 存草稿

# mail.searchPlaceholder
source: Search inbox
zh_hans: 搜索收件箱
zh_hant: 搜索收件箱

# mail.subject
source: Subject
zh_hans: 主题
zh_hant: 主題

# mail.subjectPlaceholder
source: What's it about?
zh_hans: 想说什么？
zh_hant: 想說什麼？

# mail.threadMessages
source: %1$@ messages in this conversation
zh_hans: %1$@ 条对话
zh_hant: %1$@ 條對話

# mail.to
source: To
zh_hans: 收件人
zh_hant: 收件人

# mail.tryDifferent
source: Try a different name or subject.
zh_hans: 换个词试试？
zh_hant: 換個詞試試？

# mail.unreadTab
source: Unread · %1$@
zh_hans: 未读 · %1$@
zh_hant: 未讀 · %1$@

# mail.writeReply
source: Write a reply
zh_hans: 写回复
zh_hant: 寫回復

# mailcard.checkingInbox
source: Checking your inbox…
zh_hans: 正在查收件箱…
zh_hant: 正在查收件箱…

# mailcard.couldntDisplay
source: The email could not be displayed.
zh_hans: 这封邮件显示不了。
zh_hant: 這封郵件顯示不了。

# mailcard.foundAtLeast
source: Found at least %1$@ emails
zh_hans: 找到至少 %1$@ 封邮件
zh_hant: 找到至少 %1$@ 封郵件

# mailcard.foundMany
source: Found %1$@ emails
zh_hans: 找到 %1$@ 封邮件
zh_hant: 找到 %1$@ 封郵件

# mailcard.foundOne
source: Found 1 email
zh_hans: 找到 1 封邮件
zh_hant: 找到 1 封郵件

# mailcard.messages
source: %1$@ messages
zh_hans: %1$@ 条消息
zh_hant: %1$@ 條消息

# mailcard.noMatch
source: No matching emails
zh_hans: 没有匹配的邮件
zh_hant: 沒有匹配的郵件

# mailcard.noResults
source: The mailbox did not return readable results.
zh_hans: 邮箱没有返回可读的结果。
zh_hant: 郵箱沒有返回可讀的結果。

# mailcard.oneMessage
source: 1 message
zh_hans: 1 条消息
zh_hant: 1 條消息

# mailcard.openEmail
source: Open email
zh_hans: 打开邮件
zh_hant: 打開郵件

# mailcard.paused
source: Mail reading paused
zh_hans: 邮件读取已暂停
zh_hant: 郵件讀取已暫停

# mailcard.readingEmail
source: Reading the email…
zh_hans: 正在读邮件…
zh_hant: 正在讀郵件…

# mcp.addServer
source: Add server
zh_hans: 添加服务器
zh_hant: 添加服務器

# mcp.approval.allow
source: Allow
zh_hans: 允许
zh_hant: 允許

# mcp.approval.args
source: What it will send
zh_hans: 要传的参数
zh_hant: 要傳的參數

# mcp.approval.deny
source: Deny
zh_hans: 拒绝
zh_hant: 拒絕

# mcp.approval.remember
source: Remember my choice
zh_hans: 记住我的选择
zh_hant: 記住我的選擇

# mcp.approval.title
source: The AI wants to call a tool
zh_hans: AI 想调用一个工具
zh_hant: AI 想呼叫一個工具

# mcp.approval.toolFrom
source: "%1$@" on "%2$@"
zh_hans: 「%1$@」的「%2$@」
zh_hant: 「%1$@」的「%2$@」

# mcp.askUser.submit
source: Done
zh_hans: 好了
zh_hant: 好了

# mcp.askUser.title
source: A few questions for you
zh_hans: 问你几个问题
zh_hant: 問你幾個問題

# mcp.headers
source: Headers
zh_hans: 请求头
zh_hant: 請求頭

# mcp.headersHint
source: One per line, e.g. X-API-Key: $%1$@. Use ${} for env var names.
zh_hans: 一行一个，比如 X-API-Key: $%1$@。${} 里写环境变量名。
zh_hant: 一行一個，比如 X-API-Key: $%1$@。${} 裏寫環境變量名。

# mcp.intro
source: Connect external MCP servers — maps, databases, anything. This is how capabilities grow.
zh_hans: 接外部 MCP 服务器，高德地图、数据库什么的都能连。能力边界就靠这个扩。
zh_hant: 接外部 MCP 服務器，高德地圖、數據庫什麼的都能連。能力邊界就靠這個擴。

# mcp.name
source: Name
zh_hans: 名字
zh_hant: 名字

# mcp.namePlaceholder
source: e.g. Amap
zh_hans: 比如：高德地图
zh_hant: 比如：高德地圖

# mcp.oauth.authorize
source: Authorize
zh_hans: 授权登录
zh_hant: 授權登錄

# mcp.oauth.authorizing
source: Authorizing…
zh_hans: 授权中…
zh_hant: 授權中…

# mcp.oauth.failedTitle
source: Authorization failed
zh_hans: 授权失败
zh_hant: 授權失敗

# mcp.oauth.success
source: "%1$@" is authorized. Its tools won't ask you to log in again.
zh_hans: 「%1$@」已授权，以后调用它的工具不用再登录了。
zh_hant: 「%1$@」已授權，以後調用它的工具不用再登錄了。

# mcp.oauth.successTitle
source: Authorized
zh_hans: 授权成功
zh_hant: 授權成功

# mcp.oauthScopes
source: Scopes
zh_hans: 权限范围
zh_hant: 權限範圍

# mcp.title
source: MCP Servers
zh_hans: MCP 服务器
zh_hant: MCP 服務器

# mcp.tools.allow
source: Allow
zh_hans: 放行
zh_hant: 放行

# mcp.tools.ask
source: Ask
zh_hans: 每次问
zh_hant: 每次問

# mcp.tools.deny
source: Deny
zh_hans: 禁止
zh_hant: 禁止

# mcp.tools.empty
source: This server exposes no tools.
zh_hans: 这个服务器没有工具。
zh_hant: 這個伺服器沒有工具。

# mcp.tools.hint
source: Set a rule per tool: ask you each time, always allow, or never call it.
zh_hans: 给每个工具定个规矩：每次都问你、直接放行，还是永远不许调用。
zh_hant: 給每個工具定個規矩：每次都問你、直接放行，還是永遠不許調用。

# mcp.tools.loadFailed
source: Couldn't reach the server: %1$@
zh_hans: 连不上服务器：%1$@
zh_hant: 連不上伺服器：%1$@

# mcp.tools.loading
source: Connecting to list tools…
zh_hans: 正在连接服务器读工具列表…
zh_hant: 正在連接伺服器讀工具列表…

# mcp.tools.manage
source: Tool permissions
zh_hans: 工具权限
zh_hant: 工具權限

# mcp.tools.needAuth
source: This server needs OAuth login first — tap Authorize, then try again.
zh_hans: 这个服务器要先点「授权」登录，再来读工具列表。
zh_hant: 這個伺服器要先點「授權」登入，再來讀工具列表。

# mcp.tools.retry
source: Retry
zh_hans: 重试
zh_hant: 重試

# mcp.transport
source: Transport
zh_hans: 传输方式
zh_hant: 傳輸方式

# mcp.url
source: Server URL
zh_hans: 服务器地址
zh_hant: 服務器地址

# mcp.useOAuth
source: Requires OAuth login
zh_hans: 需要登录授权 (OAuth)
zh_hant: 需要登錄授權 (OAuth)

# meeting.liveTitle
source: Meeting in progress
zh_hans: 正在开会
zh_hant: 正在開會

# meeting.members
source: %1$@ members
zh_hans: %1$@ 个成员
zh_hant: %1$@ 個成員

# meeting.round
source: Round %1$@ of %2$@ in discussion
zh_hans: 第 %1$@/%2$@ 轮讨论中
zh_hant: 第 %1$@/%2$@ 輪討論中

# meeting.stop
source: Stop
zh_hans: 叫停
zh_hant: 叫停

# meeting.stoppedByHer
source: She stopped the discussion
zh_hans: 她叫停了这次讨论
zh_hant: 她叫停了這次討論

# memory.addedInApps
source: User added in Apps
zh_hans: 在 App 里添加
zh_hant: 在 App 裏添加

# moodcheck.actions.delete
source: Delete mood entry
zh_hans: 删除这条心情
zh_hant: 刪除這條心情

# moodcheck.config.hourLabel
source: Ask every day at (Shanghai time)
zh_hans: 每天问候的时间（北京时间）
zh_hant: 每天問候的時間（北京時間）

# moodcheck.item.fromChat
source: from chat
zh_hans: 来自聊天
zh_hant: 來自聊天

# moodcheck.item.fromCheckin
source: from the daily check-in
zh_hans: 来自每日问候
zh_hant: 來自每日問候

# moodcheck.list.empty
source: Nothing recorded yet. When he asks and you answer, it'll show up here.
zh_hans: 还没有记录。他问起、你回答之后，就会显示在这里。
zh_hant: 還沒有記錄。他問起、你回答之後，就會顯示在這裡。

# moodcheck.list.title
source: Mood timeline
zh_hans: 心情时间线
zh_hant: 心情時間線

# moodcheck.section.desc
source: Once a day he gently asks how you're doing. Everything recorded is listed here, deletable anytime.
zh_hans: 每天他会轻轻问一句你今天怎么样。记下来的都在这里，随时可以删。
zh_hant: 每天他會輕輕問一句你今天怎麼樣。記下來的都在這裡，隨時可以刪。

# moodcheck.section.title
source: Mood check-ins
zh_hans: 心情记录
zh_hant: 心情記錄

# music.addSong
source: Add song
zh_hans: 加歌
zh_hant: 加歌

# music.addToQueue
source: Add to queue
zh_hans: 加入播放队列
zh_hant: 加入播放隊列

# music.added
source: Added to playlist
zh_hans: 已加入歌单
zh_hant: 已加入歌單

# music.auth.authorized
source: Authorized
zh_hans: 已授权
zh_hant: 已授權

# music.auth.denied
source: Denied
zh_hans: 已拒绝
zh_hant: 已拒絕

# music.auth.deniedHint
source: Re-allow Apple Music access in system settings.
zh_hans: 在系统设置里重新允许 Apple Music 访问。
zh_hant: 在系統設置裏重新允許 Apple Music 訪問。

# music.auth.needAuth
source: Authorize Apple Music first
zh_hans: 先授权 Apple Music 才能用
zh_hant: 先授權 Apple Music 才能用

# music.auth.noSubscription
source: An Apple Music subscription is needed for playback. Local songs are unaffected.
zh_hans: 需要 Apple Music 订阅才能播放，本地歌曲不受影响。
zh_hant: 需要 Apple Music 訂閱才能播放，本地歌曲不受影響。

# music.auth.notConfigured
source: Not configured
zh_hans: 未配置
zh_hant: 未配置

# music.auth.notSubscribed
source: No subscription
zh_hans: 无订阅
zh_hant: 無訂閱

# music.auth.setupHintUser
source: Apple Music isn't connected yet. Just tell him and he'll sort it out.
zh_hans: Apple Music 还没接好。跟他说一声，让他看看就好。
zh_hant: Apple Music 還沒接好。跟他說一聲，讓他看看就好。

# music.auth.unavailable
source: Unavailable
zh_hans: 不可用
zh_hant: 不可用

# music.auth.unknown
source: Not authorized
zh_hans: 未授权
zh_hant: 未授權

# music.comments
source: Comments
zh_hans: 评论
zh_hant: 評論

# music.comments.empty
source: Quiet in here. You go first?
zh_hans: 这儿还安安静静的。你先说一句？
zh_hant: 這兒還安安靜靜的。你先說一句？

# music.comments.hint
source: What does this song remind you of…
zh_hans: 这首歌让你想起什么…
zh_hant: 這首歌讓你想起什麼…

# music.delete
source: Delete this song
zh_hans: 删除这首歌
zh_hant: 刪除這首歌

# music.deleteConfirm
source: Delete it?
zh_hans: 确定删除吗？
zh_hant: 確定刪除嗎？

# music.djWorking
source: %1$@ is DJing
zh_hans: %1$@打碟中
zh_hant: %1$@打碟中

# music.edit
source: Edit
zh_hans: 编辑
zh_hant: 編輯

# music.editSong
source: Edit song
zh_hans: 编辑歌曲
zh_hant: 編輯歌曲

# music.lyrics
source: Lyrics
zh_hans: 歌词
zh_hant: 歌詞

# music.lyrics.none
source: No lyrics for this song yet.
zh_hans: 这首歌还没有歌词。
zh_hant: 這首歌還沒有歌詞。

# music.lyrics.tapHint
source: Tap a lyric line, then ask me in chat what it means
zh_hans: 点一句歌词，去对话框问我这句什么意思
zh_hant: 點一句歌詞，去對話框問我這句什麼意思

# music.markOurs
source: Mark as our song
zh_hans: 标为我们的歌
zh_hant: 標爲我們的歌

# music.memories
source: Our memories
zh_hans: 我们的记忆
zh_hant: 我們的記憶

# music.noAudio
source: This song has no audio attached yet. Open the song menu, tap "Edit", and add audio to play it.
zh_hans: 这首还没音频，放不了。在歌曲菜单里点「编辑」，给它加上音频吧。
zh_hant: 這首還沒音頻，放不了。在歌曲菜單裏點「編輯」，給它加上音頻吧。

# music.noAudioShort
source: No audio, can't play
zh_hans: 没音频，放不了
zh_hant: 沒音頻，放不了

# music.nothingPlaying
source: Quiet in here. Pick a song, or tell me to play one.
zh_hans: 安安静静的。点一首，或者跟我说「放首歌」。
zh_hant: 安安靜靜的。點一首，或者跟我說「放首歌」。

# music.nowPlaying
source: Now playing
zh_hans: 正在播放
zh_hant: 正在播放

# music.pause
source: Pause
zh_hans: 暂停
zh_hant: 暫停

# music.pickAudio
source: Pick audio file
zh_hans: 选音频文件
zh_hant: 選音頻文件

# music.pickCover
source: Pick cover
zh_hans: 选封面
zh_hant: 選封面

# music.play
source: Play
zh_hans: 播放
zh_hant: 播放

# music.playlist.create
source: New playlist
zh_hans: 新建歌单
zh_hant: 新建歌單

# music.playlist.nameHint
source: Playlist name…
zh_hans: 歌单名字…
zh_hant: 歌單名字…

# music.playlist.ours
source: Our songs
zh_hans: 我们的歌
zh_hant: 我們的歌

# music.playlist.shared
source: Shared playlist
zh_hans: 共享歌单
zh_hant: 共享歌單

# music.playlists
source: Playlists
zh_hans: 歌单
zh_hant: 歌單

# music.prev
source: Previous
zh_hans: 上一首
zh_hant: 上一首

# music.queue
source: Coming up
zh_hans: 接下来播放
zh_hant: 接下來播放

# music.queue.empty
source: The queue is empty. Pick one and let's listen together.
zh_hans: 队列空空的。点一首，我们一起听。
zh_hant: 隊列空空的。點一首，我們一起聽。

# music.remove
source: Remove
zh_hans: 删除
zh_hant: 刪除

# music.save
source: Save
zh_hans: 保存
zh_hant: 保存

# music.skip
source: Next
zh_hans: 切歌
zh_hant: 切歌

# music.song.albumHint
source: Album (optional)
zh_hans: 专辑（可选）
zh_hant: 專輯（可選）

# music.song.artistHint
source: Artist
zh_hans: 歌手
zh_hant: 歌手

# music.song.audioHint
source: Audio URL or local file (optional)
zh_hans: 音频链接或本地文件（可选）
zh_hant: 音頻鏈接或本地文件（可選）

# music.song.coverHint
source: Cover
zh_hans: 封面
zh_hant: 封面

# music.song.lyricsHint
source: Lyrics (LRC format, optional)
zh_hans: 歌词（LRC 格式，可选）
zh_hant: 歌詞（LRC 格式，可選）

# music.song.pickAudio
source: Pick an audio file
zh_hans: 从文件里选一段音频
zh_hant: 從文件裏選一段音頻

# music.song.titleHint
source: Title
zh_hans: 歌名
zh_hant: 歌名

# music.songs
source: Songs
zh_hans: 歌曲
zh_hant: 歌曲

# music.songs.empty
source: This playlist is empty. Add some of our songs?
zh_hans: 歌单空空的。加几首我们的歌？
zh_hant: 歌單空空的。加幾首我們的歌？

# music.source.addFromApple
source: Find songs on Apple Music
zh_hans: 从 Apple Music 找歌
zh_hant: 從 Apple Music 找歌

# music.source.authorize
source: Authorize
zh_hans: 授权
zh_hant: 授權

# music.source.authorizing
source: Authorizing…
zh_hans: 授权中…
zh_hant: 授權中…

# music.source.local
source: Local
zh_hans: 本地
zh_hant: 本地

# music.source.localDefault
source: Default source, songs on this phone
zh_hans: 默认音源，手机里的歌
zh_hant: 默認音源，手機裏的歌

# music.source.noResults
source: No songs found. Try different words.
zh_hans: 没找到相关的歌，换个词试试
zh_hant: 沒找到相關的歌，換個詞試試

# music.source.searchFailed
source: Search failed. Try again.
zh_hans: 搜歌失败，再试一次
zh_hant: 搜歌失敗，再試一次

# music.source.searchHint
source: Search title or artist…
zh_hans: 搜歌名或歌手…
zh_hant: 搜歌名或歌手…

# music.source.title
source: Music source
zh_hans: 音乐源
zh_hant: 音樂源

# music.title
source: Music Room
zh_hans: 听歌房
zh_hant: 聽歌房

# music.together.invite
source: Listen with me
zh_hans: 拉我一起听
zh_hant: 拉我一起聽

# music.together.listening
source: Listening together
zh_hans: 一起听歌中
zh_hant: 一起聽歌中

# music.together.off
source: Solo
zh_hans: 自己听
zh_hant: 自己聽

# music.togetherListened
source: Listened together on %1$@
zh_hans: %1$@一起听过
zh_hant: %1$@一起聽過

# music.togetherListenedMore
source: (%1$@ times)
zh_hans: 等%1$@次
zh_hant: 等%1$@次

# music.unmarkOurs
source: Unmark our song
zh_hans: 取消我们的歌
zh_hant: 取消我們的歌

# napp.appleMusic.desc
source: Plays the songs you request in the music room. Same authorization as the music room.
zh_hans: 听歌房播你点播的歌。授权状态和听歌房是同一份。
zh_hant: 聽歌房播你點播的歌。授權狀態和聽歌房是同一份。

# napp.calendar.desc
source: I can check your schedule and note appointments, no need to flip through the calendar.
zh_hans: 我能帮你查日程、记约会，不用你翻日历。
zh_hant: 我能幫你查日程、記約會，不用你翻日曆。

# napp.calendar.name
source: Calendar
zh_hans: 日历
zh_hant: 日曆

# napp.contacts.desc
source: So I know who's who when you mention a name.
zh_hans: 知道谁是谁，你说名字我就知道找谁。
zh_hant: 知道誰是誰，你說名字我就知道找誰。

# napp.contacts.name
source: Contacts
zh_hans: 通讯录
zh_hant: 通訊錄

# napp.deviceInfo.charging
source: Charging
zh_hans: 正在充电
zh_hant: 正在充電

# napp.deviceInfo.desc
source: How much battery is left, whether it's charging — I can see it without asking you.
zh_hans: 手机还剩多少电、充没充电，我看一眼就知道，不用问你。
zh_hant: 手機還剩多少電、充沒充電，我看一眼就知道，不用問你。

# napp.deviceInfo.full
source: Fully charged
zh_hans: 已充满
zh_hant: 已充滿

# napp.deviceInfo.name
source: Battery & Device
zh_hans: 电量与设备
zh_hant: 電量與設備

# napp.deviceInfo.unavailable
source: Device info is not readable right now.
zh_hans: 设备信息现在读不到。
zh_hant: 設備信息現在讀不到。

# napp.deviceInfo.unknown
source: Unknown
zh_hans: 状态未知
zh_hant: 狀態未知

# napp.deviceInfo.unplugged
source: Not charging
zh_hans: 没在充电
zh_hant: 沒在充電

# napp.healthkit.desc
source: Steps, sleep and such — so I know you a little better.
zh_hans: 步数、睡眠这些，我多了解你一点。
zh_hant: 步數、睡眠這些，我多瞭解你一點。

# napp.healthkit.name
source: Health
zh_hans: 健康
zh_hant: 健康

# napp.healthkit.unavailable
source: Health data is not readable right now.
zh_hans: 健康数据现在读不到。
zh_hant: 健康數據現在讀不到。

# napp.homekit.desc
source: Control smart home devices — lights, AC and the like.
zh_hans: 控制家里的智能设备，灯、空调这些。
zh_hant: 控制家裏的智能設備，燈、空調這些。

# napp.homekit.name
source: Home
zh_hans: 家庭
zh_hant: 家庭

# napp.homekit.setup
source: Needs the native HomeKit module, not bundled in this build yet.
zh_hans: 要接原生 HomeKit 模块，这个版本还没装。装好就能用。
zh_hant: 要接原生 HomeKit 模塊，這個版本還沒裝。裝好就能用。

# napp.intro
source: Native capabilities Apple lets apps request. I can only help once you allow them — your call.
zh_hans: 这些是苹果允许 App 申请的原生能力。开了我才能帮你，用不用你说了算。
zh_hant: 這些是蘋果允許 App 申請的原生能力。開了我才能幫你，用不用你說了算。

# napp.openSettings
source: Open Settings
zh_hans: 去设置里开
zh_hant: 去設置裏開

# napp.reminders.desc
source: Nudges you on time, so nothing slips.
zh_hans: 到点提醒你，事情不会忘。
zh_hant: 到點提醒你，事情不會忘。

# napp.reminders.name
source: Reminders
zh_hans: 提醒事项
zh_hant: 提醒事項

# napp.shazam.desc
source: Hear something nice? Ask me what it is.
zh_hans: 听到好听的歌，问我这是什么。
zh_hant: 聽到好聽的歌，問我這是什麼。

# napp.shazam.name
source: Music Recognition
zh_hans: 听歌识曲
zh_hant: 聽歌識曲

# napp.shazam.setup
source: Needs the native ShazamKit module, not bundled in this build yet.
zh_hans: 要接原生 ShazamKit 模块，这个版本还没装。
zh_hant: 要接原生 ShazamKit 模塊，這個版本還沒裝。

# napp.siri.desc
source: One sentence to Siri and Dudu gets moving. Add “Ask Dudu” in the Shortcuts app to set it up.
zh_hans: 跟 Siri 说一句话就能使唤嘟嘟。去“快捷指令”里加上 Ask Dudu 就行。
zh_hant: 跟 Siri 說一句話就能使喚嘟嘟。去“捷徑”裡加上 Ask Dudu 就行。

# napp.siri.name
source: Siri Shortcuts
zh_hans: Siri 快捷指令
zh_hant: Siri 快捷指令

# napp.siri.setup
source: Bundled with the app — add the intents in the Shortcuts app.
zh_hans: 已随 App 内置，去“快捷指令”里添加即可。
zh_hant: 已隨 App 內建，去“捷徑”裡加入即可。

# napp.status.denied
source: Denied
zh_hans: 已拒绝
zh_hant: 已拒絕

# napp.status.granted
source: Authorized
zh_hans: 已授权
zh_hant: 已授權

# napp.status.needsSetup
source: Needs setup
zh_hans: 要先准备一下
zh_hant: 要先準備一下

# napp.status.unavailable
source: Unavailable
zh_hans: 不可用
zh_hant: 不可用

# napp.status.undetermined
source: Not authorized
zh_hans: 未授权
zh_hant: 未授權

# napp.sysAuth
source: System authorization
zh_hans: 系统授权
zh_hant: 系統授權

# napp.title
source: Native App Authorizations
zh_hans: 原生应用授权
zh_hant: 原生應用授權

# napp.weather.desc
source: Tells you the weather before you head out.
zh_hans: 出门前告诉你天气，带不带伞。
zh_hant: 出門前告訴你天氣，帶不帶傘。

# napp.weather.name
source: Weather
zh_hans: 天气
zh_hant: 天氣

# napp.weather.setup
source: WeatherKit needs a paid developer account plus a server — skipping for now.
zh_hans: 天气服务要付费开发者账号加服务器，这个版本先不接。
zh_hant: 天氣服務要付費開發者賬號加服務器，這個版本先不接。
